app/Http/Helpers.php

    function get_cached_products($category_id = null)
    {
        $products = \App\Models\Product::where('published', 1)->where('approved', '1')->where('auction_product', 0);
        $verified_sellers = verified_sellers_id();
        if (get_setting('vendor_system_activation') == 1) {
            $products = $products->where(function ($p) use ($verified_sellers) {
                $p->where('added_by', 'admin')->orWhere(function ($q) use ($verified_sellers) {
                    $q->whereIn('user_id', $verified_sellers);
                });
            });
        } else {
            $products = $products->where('added_by', 'admin');
        }

        if ($category_id != null) {
            return Cache::remember('products-category-' . $category_id, 86400, function () use ($category_id, $products) {
                $category_ids = CategoryUtility::children_ids($category_id);
                $category_ids[] = $category_id;
                return $products->whereIn('category_id', $category_ids)->latest()->take(12)->get();
---
select * from `products` where `published` = 1 and `approved` = '1' and `auction_product` = 0 and (`added_by` = 'admin' or (0 = 1)) and `category_id` in (8) order by `created_at` desc limit 12

    function get_system_default_currency()
    {
        return Cache::remember('system_default_currency', 86400, function () {
            return Currency::findOrFail(get_setting('system_default_currency'));
---
select * from `currencies` where `currencies`.`id` = '1' limit 1

    function uploaded_asset($id)
    {
        if (($asset = \App\Models\Upload::find($id)) != null) {
---
select * from `uploads` where `uploads`.`id` is null and `uploads`.`deleted_at` is null limit 1

    function get_setting($key, $default = null, $lang = false)
    {
        $settings = Cache::remember('business_settings', 86400, function () {
            return BusinessSetting::all();
---
select * from `business_settings`

    function addon_is_activated($identifier, $default = null)
    {
        $addons = Cache::remember('addons', 86400, function () {
            return Addon::all();
---
select * from `addons`