app/Http/Controllers/HomeController.php

select * from `categories` where `categories`.`id` = '7' limit 1
---
    public function get_category_items(Request $request)
    {
        $category = Category::findOrFail($request->id);